#+title Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.config/emacs/init.el

** Line numering

 #+begin_src emacs-lisp
   ;; Disable line numbers in some modes
   (dolist (mode '(org-mode-hook
		   dired-mode-hook
		   term-mode-hook
		   eww-mode-hook
		   pdf-view-mode-hook
		   eshell-mode-hook))
     (add-hook mode (lambda () (display-line-numbers-mode 0))))

   ;; Line numbers
   (global-display-line-numbers-mode t)
   (setq global-display-line-numbers 'relative)
   (set-default 'display-line-numbers 'relative)

 #+end_src

#+RESULTS:
: ((font . Roboto Mono-11) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

